{
     "peliculas": [
         {
             "id": 0,
             "titulo": "Harry Potter y la piedra filosofal",
             "director": "Chris Columbus",
             "poster": "hp1.jpg",
             "categorias": ["Aventuras", "Fatástico", "Magia"],
             "anio": 2001,
             "duracion": 152,
             "precio": 9.99,
             "actores": ["Daniel Radcliffe", "Rupert Grint", "Emma Watson", "Richard Harris", "Alan Rickman"],
             "sinopsis": "El día en que cumple once años, Harry Potter se entera de que es hijo de dos destacados hechiceros, de los que ha heredado poderes mágicos. En la escuela Hogwarts de Magia y Hechicería, donde se educa con otros niños que también tienen poderes especiales, aprenderá todo lo necesario para ser mago."
         },
         {
             "id": 1,
             "titulo": "Harry Potter y la cámara secreta",
             "director": "Chris Columbus",
             "poster": "hp2.jpg",
             "categorias": ["Aventuras", "Fatástico", "Magia"],
             "anio": 2002,
             "duracion": 154,
             "precio": 10.99,
             "actores": ["Daniel Radcliffe", "Rupert Grint", "Emma Watson", "Richard Harris", "Alan Rickman"],
             "sinopsis": "Terminado el verano, Harry (Radcliffe) no ve la hora de abandonar la casa de sus odiosos tíos, pero, inesperadamente se presenta en su dormitorio Dobby, un elfo doméstico, que le anuncia que correrá un gran peligro si vuelve a Hogwarts. A pesar de los esfuerzos del elfo por retenerlo, Harry es rescatado por Ron y sus hermanos, con la ayuda de un coche volador, y recibido con los brazos abiertos en el cálido hogar de los Weasley. A pesar de que a Harry y a Ron les impiden entrar en el andén nueve y tres cuartos y subir al Expreso de Hogwarts, ellos se las arreglan para llegar a tiempo de empezar el nuevo curso. Las hazañas de nuestro héroe ya se han extendido por todo el colegio, convirtiéndolo en el centro de una atención no deseada. Entre sus nuevos admiradores está Ginny (Bonnie Wright), la hermana pequeña de Ron; el aspirante a fotógrafo Colin Creevey (Hugh Mitchell) y Gilderoy Lockhart (Branagh), el nuevo y vanidoso profesor de defensa contra las artes oscuras. Sin embargo, ni siquiera Lockhart puede ofrecer una explicación plausible ni una solución eficaz para combatir el terror que se está apoderando del colegio. En tal circunstancia, la atención se centra en Harry, pero todos empiezan a dudar de él. Todos, excepto Ron, Hermione y la pequeña y frágil Ginny, que vive volcada en su nuevo y misterioso diario. Pero Harry no decepcionará a sus amigos y se enfrentará a la oscura fuerza que acecha Hogwarts."
         },
         {
             "id": 2,
             "titulo": "Harry Potter y el prisionero de Azkaban",
             "director": "Alfonso Cuarón",
             "poster": "hp3.jpg",
             "categorias": ["Aventuras", "Fatástico", "Magia"],
             "anio": 2004,
             "duracion": 137,
             "precio": 11.99,
             "actores": ["Daniel Radcliffe", "Rupert Grint", "Emma Watson", "Michael Gambon", "Alan Rickman"],
             "sinopsis": "Cuando Harry Potter y sus amigos vuelven a Hogwarts para cursar su tercer año de estudios, se ven involucrados en un misterio: de la prisión para magos de Azkaban se ha fugado Sirius Black, un peligroso mago que fue cómplice de Lord Voldemort y que intentará vengarse de Harry Potter. El joven aprendiz de mago contribuyó en gran medida a la condena de Sirius, por lo que hay razones para temer por su vida."
         },
         {
             "id": 3,
             "titulo": "Harry Potter y el cáliz de fuego",
             "director": "Mike Newell",
             "poster": "hp4.jpg",
             "categorias": ["Aventuras", "Fatástico", "Magia"],
             "anio": 2005,
             "duracion": 157,
             "precio": 12.99,
             "actores": ["Daniel Radcliffe", "Rupert Grint", "Emma Watson", "Michael Gambon", "Alan Rickman"],
             "sinopsis": "La cuarta parte de la serie del niño mago comienza con la Copa Internacional de Quidditch. Cuenta también el inicio de la atracción por Cho Chang y otro año de magia, en el que una gran sorpresa obligará a Harry a enfrentarse a muchos desafíos temibles. También habrá un torneo de magia para tres escuelas, y el temido regreso de Aquel-que-no-debe-ser-nombrado."
         },
         {
             "id": 4,
             "titulo": "Harry Potter y la orden del fénix",
             "director": "David Yates",
             "poster": "hp5.jpg",
             "categorias": ["Aventuras", "Fatástico", "Magia"],
             "anio": 2007,
             "duracion": 138,
             "precio": 13.99,
             "actores": ["Daniel Radcliffe", "Rupert Grint", "Emma Watson", "Michael Gambon", "Alan Rickman"],
             "sinopsis": "Las tediosas vacaciones en casa de sus tíos todavía no han acabado y Harry se encuentra más inquieto que nunca. Apenas ha tenido noticias de Ron y Hermione y presiente que algo extraño está sucediendo en Hogwarts. En efecto, cuando por fin empieza el curso, sus temores se hacen realidad. El Ministerio de Magia niega que Voldemort haya regresado e inicia una campaña de desprestigio contra Harry y Dumbledore, encomendando a la horrible profesora Dolores Umbridge la tarea de vigilar todos sus movimientos. Así, pues, además de sentirse solo e incomprendido, Harry sospecha que Voldemort puede adivinar sus pensamientos e intuye que el temible mago trata de apoderarse de un objeto secreto que le permitiría recuperar su destructivo poder."
         },
         {
             "id": 5,
             "titulo": "Harry Potter y el misterio del príncipe",
             "director": "David Yates",
             "poster": "hp6.jpg",
             "categorias": ["Aventuras", "Fatástico", "Magia"],
             "anio": 2009,
             "duracion": 153,
             "precio": 14.99,
             "actores": ["Daniel Radcliffe", "Rupert Grint", "Emma Watson", "Michael Gambon", "Alan Rickman"],
             "sinopsis": "Con dieciséis años cumplidos, Harry inicia el sexto curso en Hogwarts en medio de terribles acontecimientos que asolan Inglaterra. Elegido capitán del equipo de Quidditch, los entrenamientos, los exámenes y las chicas ocupan todo su tiempo, pero la tranquilidad dura poco. A pesar de los férreos controles de seguridad que protegen la escuela, dos alumnos son brutalmente atacados. Dumbledore sabe que se acerca el momento, anunciado por la Profecía, en que Harry y Voldemort se enfrentarán a muerte. El anciano director pedirá ayuda a Harry y juntos emprenderán un peligroso viaje. Para debilitar al enemigo, el joven mago cuenta con la ayuda de un viejo libro de pociones perteneciente a un misterioso personaje que se hace llamar el Príncipe Mestizo."
         },
         {
             "id": 6,
             "titulo": "Harry Potter y las reliquias de la muerte - parte 1",
             "director": "David Yates",
             "poster": "hp7.jpg",
             "categorias": ["Aventuras", "Fatástico", "Magia"],
             "anio": 2010,
             "duracion": 146,
             "precio": 15.99,
             "actores": ["Daniel Radcliffe", "Rupert Grint", "Emma Watson", "Michael Gambon", "Alan Rickman"],
             "sinopsis": "Primera parte de la adaptación al cine del último libro de la saga Harry Potter. Es una continuación de la historia recogida en El misterio del príncipe. Una misión casi imposible cae sobre los hombros de Harry: deberá encontrar y destruir a los últimos horrocruxes para poner fin al reinado de Lord Voldemort. En el episodio final de la saga, el joven hechicero de 17 años emprende con sus amigos Hermione Granger y Ron Weasley un peligroso viaje por Inglaterra para encontrar los objetos que contienen los fragmentos del alma del Señor Tenebroso, que son los que garantizan su longevidad. Pero la tarea no será fácil, pues el poder del lado oscuro crece cada vez más, y las más firmes lealtades serán puestas a prueba. Harry deberá usar todos los conocimientos que ha adquirido gracias a Dumbledore para enfrentarse a su enemigo y encontrar la forma de sobrevivir a esta última aventura."
         },
         {
             "id": 7,
             "titulo": "Harry Potter y las reliquias de la muerte - parte 2",
             "director": "David Yates",
             "poster": "hp8.jpg",
             "categorias": ["Aventuras", "Fatástico", "Magia"],
             "anio": 2011,
             "duracion": 130,
             "precio": 16.99,
             "actores": ["Daniel Radcliffe", "Rupert Grint", "Emma Watson", "Michael Gambon", "Alan Rickman"],
             "sinopsis": "El final ha llegado. Harry, Hermione y Ron tendrán que recuperar la espada de Gryffindor para encontrar y destruir los últimos horrocruxes. Mientras tanto, Lord Voldemort está a punto de apoderarse por completo de Hogwarts y de conseguir su objetivo: matar a Harry Potter. La única esperanza de Harry es encontrar los horrocruxes antes de que Voldemort lo encuentre a él. Buscando pistas, descubre una antigua y olvidada historia: la leyenda de las reliquias de la muerte, que podría dar al malvado Lord el poder definitivo. Pero el futuro de Harry está escrito desde que nació e incluye una misión para la que se ha estado preparando desde que llegó a Hogwarts: la batalla final contra Voldemort."
         },
         {
             "id": 8,
             "titulo": "Ocean's Thirteen",
             "director": "Steven Soderbergh",
             "poster": "o13.jpg",
             "categorias": ["Thriller", "Intriga", "Atracos"],
             "anio": 2007,
             "duracion": 115,
             "precio": 11.99,
             "actores": ["George Clooney", "Brad Pitt", "Matt Damon", "Al Pacino", "Ellen Barkin", "Andy García"],
             "sinopsis": "Danny Ocean (George Clooney) y su banda preparan un ambicioso y arriesgado plan para robar un casino. Su único objetivo, en este caso, es defender a uno de los suyos, que ha sido engañado por Willy Bank (Al Pacino), el despiadado dueño del casino."
         },
         {
             "id": 10,
             "titulo": "La guerra de las galaxias. Episodio IV: Una nueva esperanza",
             "director": "George Lucas",
             "poster": "sw4.jpg",
             "categorias": ["Ciencia Ficción", "Aventuras"],
             "anio": 1977,
             "duracion": 121,
             "precio": 7.99,
             "actores": ["Mark Hamill", "Harrison Ford", "Carrie Fisher", "Alec Guinness", "Peter Cushing"],
             "sinopsis": "La princesa Leia, líder del movimiento rebelde que desea reinstaurar la República en la galaxia en los tiempos ominosos del Imperio, es capturada por las Fuerzas Imperiales, capitaneadas por el implacable Darth Vader, el sirviente más fiel del Emperador. El intrépido y joven Luke Skywalker, ayudado por Han Solo, capitán de la nave espacial El Halcón Milenario, y los androides, R2D2 y C3PO, serán los encargados de luchar contra el enemigo e intentar rescatar a la princesa para volver a instaurar la justicia en el seno de la galaxia."
         },
         {
             "id": 11,
             "titulo": "La guerra de las galaxias. Episodio VIII: El despertar de la fuerza",
             "director": "J.J. Abrams",
             "poster": "sw7.jpg",
             "categorias": ["Ciencia Ficción", "Aventuras"],
             "anio": 2015,
             "duracion": 135,
             "precio": 15.99,
             "actores": ["Daisy Ridley", "John Boyega", "Harrison Ford", "Adam Driver", "Oscar Isaac"],
             "sinopsis": "Treinta años después de la victoria de la Alianza Rebelde sobre la segunda Estrella de la Muerte (hechos narrados en el Episodio VI: El retorno del Jedi), la galaxia está todavía en guerra. Una nueva República se ha constituido, pero una siniestra organización, la Primera Orden, ha resurgido de las cenizas del Imperio Galáctico. A los héroes de antaño, que luchan ahora en la Resistencia, se suman nuevos héroes: Poe Dameron, un piloto de caza, Finn, un soldado desertor de la Primera Orden, Rey, una joven chatarrera, y BB-8, un androide rodante. Todos ellos luchan contra las fuerzas del Mal: el Capitán Phasma, de la Primera Orden, y Kylo Ren, un temible y misterioso personaje que empuña un sable de luz roja."
         }
     ]
}
